---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsParallelpipesHorizontalOffsetValue
source: html/e0da2e5b-14e7-7348-ea1c-7baa398e117b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsParallelpipesHorizontalOffsetValue Property

"Horizontal Offset value for parallel pipes"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsParallelpipesHorizontalOffsetValue { get; }
```